[
    {
        "title":"Turing Test",
        "content":"A test of a machine's ability to exhibit intelligent behaviour equivalent to, or indistinguishable from, that of a human. Turing proposed that a human evaluator would judge natural language conversations between a human and a machine designed to generate human-like responses. The evaluator would be aware that one of the two partners in conversation was a machine, and all participants would be separated from one another. The conversation would be limited to a text-only channel, such as a computer keyboard and screen, so the result would not depend on the machine's ability to render words as speech. If the evaluator could not reliably tell the machine from the human, the machine would be said to have passed the test. The test results would not depend on the machine's ability to give correct answers to questions, only on how closely its answers resembled those a human would give.",
        "creator":1,
        "created_date":"03/14/1950"
    },
    {
        "title":"Laws of Robotics",
        "content":"A robot may not injure a human being or, through inaction, allow a human being to come to harm. A robot must obey orders given it by human beings except where such orders would conflict with the First Law. A robot must protect its own existence as long as such protection does not conflict with the First or Second Law.",
        "creator":2,
        "created_date":"01/06/1942"
    },
    {
        "title":"AC Power",
        "content":"Tesla developed polyphase alternating current systems of generators, motors and transformers, eventually holding 40 basic US patents. These were bought by George Westinghouse, who was determined to supply America with the Tesla system, which eventually won out as the superior technology and became the standard power in the 20th century.",
        "creator":3,
        "created_date":"01/08/1888"
    },
    {
        "title":"Linux Kernel",
        "content":"the first version of the Linux kernel on September 17, 1991. The initial release was version 0.01 and it was announced on the Usenet newsgroup. The Linux kernel was based on the MINIX operating system, which was a Unix-like operating system created by Andrew S. Tanenbaum. The first version of Linux was very basic, with only a few thousand lines of code, but it was open-source and quickly gained a following among developers. Over time, Linux has grown into a full-fledged operating system with a wide range of features and capabilities, and it has become one of the most widely used operating systems in the world.",
         "creator":4,
        "created_date":"09/17/1991"
    },
    {
        "title":"Get a CLU",
        "content":"CLU was influential in the development of other programming languages such as Python, Ruby, and Perl, which borrowed some of its features and concepts. However, CLU itself never gained widespread adoption and is not commonly used today.",
         "creator":5,
        "created_date":"07/05/1976"
    }    
]